package com.example.akteruzzaman.NariOdhikar;

import android.content.Intent;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.support.v7.widget.LinearLayoutManager;
import android.support.v7.widget.RecyclerView;
import android.view.Menu;
import android.view.MenuInflater;
import android.view.MenuItem;

import java.util.ArrayList;

public class MainActivity extends AppCompatActivity {

    ArrayList<Model>data;
    RecyclerViewAdapter adapter;
    RecyclerView recyclerView;
    //testing

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);
        getSupportActionBar().setIcon(R.drawable.law);



        data=new ArrayList<>();
        data.add(new Model("নারী ও শিশু নির্যাতন মামলার প্রক্রিয়া ও শাস্তি ","বিশ্বের অনেক দেশের মতো বাংলাদেশেও বেড়েছে নারী ও শিশু নির্যাতনের ঘটনা। বেড়েছে যৌন হয়রানি, ধর্ষণসহ, অপহরণের ঘটনা। এগুলোর মধ্যে কিছু ঘটনা প্রকাশিত হলেও বেশির ভাগ ঘটনা ধামাচাপা পড়ে যায় লোকলজ্জার কারণে। এসব ঘটনায় নির্যাতিতদের আইনি সুবিধার্থে ২০০০ সালে সরকার নারী ও শিশু নির্যাতন দমন আইন তৈরি করে। সে আইনকে ২০১৩ সালে সংশোধন করে আরো কঠোর করা হয়। আইনি প্রতিকার চাইলে সে জন্য কোথায় যেতে হবে, কার কাছে যেতে হবে সে সম্পর্কে কিছু জানে না। তাই কীভাবে আইনি সুবিধা পাবেন তা বিস্তারিত তুলে ধরা হলো।"));
        data.add(new Model("যেসব অপরাধ নারী ও শিশু নির্যাতনের অন্তর্ভুক্ত ","বাংলাদেশ নারী ও শিশু নির্যাতন দমন আইন ২০০০ সংশোধিত ২০১৩ অনুযায়ী যেসব অপরাধ এ আইনের অন্তর্ভুক্ত তা হলো- দহনকারী বা ক্ষয়কারী, নারী পাচার, শিশু পাচার, নারী ও শিশু অপহরণ, মুক্তিপণ আদায়, ধর্ষণ, ধর্ষণজনিত কারণে মৃত্যু, নারীর আত্মহত্যায় প্ররোচনা, যৌন নিপীড়ন, যৌতুকের জন্য মৃত্যু ঘটানো, ভিক্ষাবৃত্তি ইত্যাদির উদ্দেশ্যে শিশুকে অঙ্গহানি, ধর্ষণের ফলে জন্মলাভকারী শিশু সংক্রান্ত বিধান। "));
        data.add(new Model("থানায় মামলা দায়ের ","উল্লিখিত যে কোনো ঘটনার শিকার হলে আপনার পার্শ্ববর্তী থানায় গিয়ে বিষয়টি জানান। বিষয়টি থানার ভারপ্রাপ্ত কর্মকর্তা (ওসি) এজাহার হিসেবে গণ্য করলে তিনি ঘটনাটি প্রাথমিক তথ্য বিবরণী ফরমে লিপিবদ্ধ করবেন। পরে বিষয়টি সংশ্লিষ্ট এখতিয়ারসম্পন্ন হাকিম আদালতে প্রেরণ করবেন। এখতিয়ারাধীন হাকিম তা গ্রহণ করলে ওই মামলার আসামিদের আদালতের সামনে উপস্থিত হওয়ার জন্য একটি তারিখ ধার্য করবেন। এবং পরবর্তী সময়ে মামলাটি বিচারের জন্য উপযুক্ত আদালত তথা নারী ও শিশু নির্যাতন অপরাধ দমন ট্রাইব্যুনালে পাঠাবেন। এরপর নারী ও শিশু নির্যাতন অপরাধ দমন ট্রাইব্যুনাল মামলাটি বিচারের জন্য সাক্ষ্য গ্রহণের তারিখ ধার্য করলে সেই তারিখে মামলাটির বাদী ও অভিযুক্তকে আদালতের সামনে হাজির হয়ে সাক্ষ্য দিতে হবে এবং মামলার পরবর্তী কার্যক্রম চলতে থাকবে।"));
        data.add(new Model("আদালতে মামলা","কোনো কারণে থানার ভারপ্রাপ্ত কর্মকর্তা (ওসি) যদি অভিযোগটি গ্রহণে অসম্মতি প্রকাশ করেন, তাহলে থানায় কারণ উল্লেখ করে মামলাটি গ্রহণ করা হয়নি মর্মে আবেদনপত্র সঙ্গে নিয়ে সরাসরি নারী ও শিশু নির্যাতন দমন ট্রাইব্যুনালে মামলা করা যাবে। এ ক্ষেত্রে মামলাকারী ব্যক্তি প্রথমে নারী ও শিশু নির্যাতন অপরাধ দমনে নিযুক্ত নারী ও শিশু পাবলিক প্রসিকিউটরের (পিপি নারী ও শিশু) কাছে প্রত্যয়ন ও সত্যায়িত করে মামলা করতে হবে। এ ছাড়া আবেদনটি বিচারকের সামনে হাজির করার সময় অভিযুক্তকে আদালতে উপস্থিত হয়ে জবানবন্দী দিয়ে মামলা করতে হবে। আদালত অভিযুক্তের জবানবন্দি শোনার পর মামলাটি আমলে নিয়ে পরবর্তী কার্যক্রম চালিয়ে যাবেন।"));
        data.add(new Model("সরকারি আইনজীবী","নারী ও শিশু নির্যাতন দমন আইনের মামলায় বাদী নিজস্ব কোনো আইনজীবী নিয়োগের প্রয়োজন নেই। ফৌজদারি কার্যবিধির ৪৯২ ধারা অনুযায়ী তিনি সরকারের পক্ষ থেকে আইনজীবী পাবেন। তিনি মামলার সব তত্ত্বাবধান করবেন। যদি বাদী নিজে আইনজীবী নিয়োগ দিতে চান তাহলে সেই আইনজীবী সরকারি আইনজীবীর অধীনে কাজ করবেন। সরকারের পক্ষ থেকে নিয়োগ দেওয়া আইনজীবীকে কোনো খরচ দিতে হবে না।"));
        data.add(new Model("বিচার প্রক্রিয়া ","দেশের প্রতিটি জেলায় একটি করে নারী ও শিশু নির্যাতন দমন ট্রাইব্যুনাল রয়েছে। এই আইনে ট্রাইব্যুনাল রুদ্ধদ্বার কক্ষে বিচার  পরিচালনাও করতে পারেন। কোনো ব্যক্তির আবেদনের পরিপ্রেক্ষিতে বা স্বীয় বিবেচনায় উপযুক্ত মনে করলে বিচারক শুধু মামলার দুই পক্ষকে এবং তাদের নিয়োজিত আইনজীবীদের নিয়ে বিচার পরিচালনা করতে পারেন। তা না করলে বিধান মোতাবেক বিচার পরিচালিত হবে।"));
        data.add(new Model("বিচারের মেয়াদ ","নারী ও শিশু নির্যাতন দমন আইন সংশোধিত আইন ২০১৩ অনুযায়ী ট্রাইব্যুনাল ১৮০ দিনের মধ্যে বিচারকাজ শেষ করবেন। ট্রাইব্যুনাল যদি ১৮০ দিনের মধ্যে মামলা নিষ্পত্তি করতে ব্যর্থ হয়,  তাহলে তার কারণসংবলিত একটি প্রতিবেদন ৩০ দিনের মধ্যে সুপ্রিম কোর্টে দাখিল করবেন। যার একটি অনুলিপি সরকারকেও দিতে হবে। তা ছাড়া এ ক্ষেত্রে পাবলিক প্রসিকিউটর ও সংশ্লিষ্ট পুলিশ কর্মকর্তা ৩০ দিনের মধ্যে সরকারের কাছে কারণ উল্লখপূর্বক প্রতিবেদন দাখিল করবেন। এ রকম দাখিলকৃত প্রতিবেদনগুলো যথাযথ কর্তৃপক্ষ কর্তৃক বিবেচিত হওয়ার পর নির্ধারিত সময়ের মধ্যে মামলা নিষ্পত্তি না হওয়ার জন্য দায়ী ব্যক্তি বা ব্যক্তিদের বিরুদ্ধে ব্যবস্থা গ্রহণ করা হবে। এই আইন অনুযায়ী পুলিশ যদি অভিযোগ গ্রহণ না করে সে ক্ষেত্রে ট্রাইব্যুনাল সরাসরি বিচারের জন্য অভিযোগ নিতে পারেন। এই বিধানটি যদি বাস্তবে প্রয়োগ করা হয়, তবে জনগণের অভিযোগ করা অনেক সহজ হবে।"));
        data.add(new Model("নিরাপত্তামূলক হেফাজত ","এই আইনের অধীন বিচার চলাকালে যদি ট্রাইব্যুনাল মনে করেন কোনো নারী বা শিশুকে নিরাপত্তামূলক হেফাজতে রাখা প্রয়োজন, তাহলে ট্রাইব্যুনাল ওই নারী বা শিশুকে কারাগারের বাইরেও সরকার কর্তৃক নির্ধারিত স্থানে বা যথাযথ অন্য কোনো ব্যক্তি বা সংস্থার হেফাজতে রাখার নির্দেশ দিতে পারেন। বিচার চলাকালে যদি অপরাধী মহল নির্যাতিত নারী বা শিশুকে আবার কোনো ধরনের আঘাত করে বা করতে চায়, তা থেকে রক্ষার জন্য এই বিধান। তা ছাড়া অভিযুক্তকে চিকিৎসা দেওয়ার জন্যও হেফাজতে রাখার নির্দেশ দিতে পারে ট্রাইব্যুনাল। তবে কোনো নারী বা শিশুকে নিরাপত্তা হেফাজতে রাখার আদেশ দেওয়ার ক্ষেত্রে ট্রাইব্যুনাল ওই নারী বা শিশুর মতামত গ্রহণ ও বিবেচনা করবেন।"));
        data.add(new Model("তদন্ত","অভিযুক্ত ব্যক্তি হাতেনাতে পুলিশের হাতে আটক হওয়ার পর ১৫ দিনের মধ্যে সংশ্লিষ্ট কর্মকর্তা তদন্ত শেষ করবে। আর অপরাধী ধরা না পড়লে তদন্তের নির্দেশ পাওয়ার ৩০ দিনের মধ্যে তদন্ত শেষ করতে হয়। নির্ধারিত সময়ের মধ্যে তদন্ত সমাপ্ত না হলে তার কারণ ব্যাখ্যা করে সময় শেষ হওয়ার ২৪ ঘণ্টার মধ্যে ট্রাইব্যুনালকে জানাতে হবে। ট্রাইব্যুনাল ইচ্ছে করলে অন্য কর্মকর্তার ওপর তদন্তভার অর্পণের আদেশ দিতে পারেন। এই আদেশ দেওয়ার সাত দিনের মধ্যে তদন্ত শেষ করতে হবে।"));
        data.add(new Model("আগাম জামিনের পথ বন্ধ","নারী ও শিশু নির্যাতন দমন আইনটি একটি বিশেষ আইন। এ মামলায় হাইকোর্টকে আগাম জামিন দেওয়ার এখতিয়ার দেওয়া হয়নি। বিশেষ আইনে জামিনের ক্ষেত্রে সাধারণত ফৌজদারি কার্যবিধির বিধানগুলো প্রযোজ্য হবে না। নারী ও শিশু নির্যাতন আইনের ১৯(২)(৩) ও (৪) উপধারায় জামিনের বিষয়ে ট্রাইব্যুনালের ক্ষমতার কথা বলা হয়েছে। ফৌজদারি কার্যবিধির কোনো বিধান ১৯ ধারায় প্রযোজ্য হয়নি। যদিও সামাজিক বাস্তবতার বিষয় চিন্তা করে কয়েক বছর ধরে হাইকোর্ট এ ধরনের মামলায় আগাম জামিন দিচ্ছেন।"));
        data.add(new Model("শাস্তি","বাংলাদেশ নারী ও শিশু নির্যাতন দমন আইন, ২০০০ সংশোধিত ২০১৩ অনুযায়ী এসব অপরাধ প্রমাণিত হলে অপরাধীর সর্বোচ্চ শাস্তি যাবজ্জীবন থেকে মৃত্যুদণ্ডও হতে পারে। এ ছাড়া রয়েছে অর্থদণ্ডের বিধান।"));
        data.add(new Model("প্রতিকারের জন্য যারা সহযোগিতা করবে","আপনি যদি মামলা করতে অসমর্থ হন বা কোনো হুমকির সম্মুখীন হন, তাহলে কয়েকটি মানবাধিকার সংগঠন রয়েছে যারা আপনাকে সহযোগিতা করবে। এগুলোর মধ্যে রয়েছে জাতীয় মানবাধিকার সংস্থা, বাংলাদেশ মহিলা আইনজীবী সমিতি, বাংলাদেশ লিগ্যাল এইড (ব্লাস্ট), আইন ও সালিশ কেন্দ্র (আসক), বাংলাদেশ মহিলা আইনজীবী সমিতি, নারী নির্যাতন প্রতিরোধ সেল প্রভৃতি।"));
        data.add(new Model("নারীর অধিকারে যত আইন","নারী নির্যাতন বন্ধে আইন প্রণয়নের দাবির পরিপ্রেক্ষিতে আশির দশকের শুরুর দিকে বিশেষ আইন প্রণয়ন করা হয়। নারী ও শিশু নির্যাতন আশঙ্কাজনক হারে বৃদ্ধি পাওয়ায় তা দমনে ১৯৮৩ সালে এ আইন প্রণয়ন করা হয়। কিন্তু নারী নির্যাতন বন্ধে এ আইন খুব বেশি কার্যকর হচ্ছিল না। ফলে আরো কঠোর আইন তৈরির প্রয়োজনীয়তা দেখা দেয়। পরে ১৯৯৫ সালে নারী ও শিশু নির্যাতন আইন পাস করা হয়। এ আইন পাসের পর নারী নির্যাতন কিছুটা বন্ধ হয়। পরে আইনটি বাতিলক্রমে ২০০০ সালে নতুন করে নারী ও শিশু নির্যাতন দমন আইন প্রণয়ন করা হয়। আইনটিকে আরো শক্তিশালী করতে ২০০৩ সালে নারী ও শিশু নির্যাতন দমন (সংশোধন) আইন প্রণয়ন করা হয়। এছাড়া এসিড-সন্ত্রাস দমন আইন ২০০২ ও যৌতুক নিষিদ্ধকরণ আইন ১৯৮০, পারিবারিক সহিংসতা (প্রতিরোধ ও সুরক্ষা) আইন ২০১০ প্রভৃতি আইন রয়েছে।\n" +
                "\n" +
                "এ ছাড়া নারীনীতিসহ কিছু নীতি ও আইন আছে, যেখানে পরোক্ষভাবে নারীর অধিকার ও স্বার্থকে রক্ষা করা হয়েছে। দেশে প্রথমবার নারীনীতি আইন প্রণয়ন করা হয় ১৯৯৭ সালে, এরপর ২০০৪ ও ২০০৮ সালে তা সংশোধন করা হয়। সর্বশেষ ২০১১ সালে পুনরায় নারীনীতি প্রণয়ন করা হয়।\n" +
                "\n" +
                "এ ছাড়া পুরুষকে তালাক দেওয়ার ক্ষেত্রে আইন না থাকলেও মুসলিম পারিবারিক আইন ১৯৬১ মোতাবেক নারীদের বিবাহবিচ্ছেদেরও অধিকার দেওয়া হয়। পারিবারিক আইনে নারীর অধিকার স্বীকৃত হয়েছে। কিন্তু সামাজিকভাবে ইতিবাচক দৃষ্টিভঙ্গি না থাকায় নারী তার প্রাপ্য অধিকার থেকে বঞ্চিত হচ্ছে। সংবিধান এবং আইনে থাকলেও নারীর প্রতি বৈষম্য বিরাজ করছে সমাজের সর্বক্ষেত্রেই।"));
        data.add(new Model("আইনের বাস্তবায়ন","নারীর অধিকার বাস্তবায়নে বাংলাদেশে অনেক আইন ও নীতিমালা রয়েছে। কিন্তু আইনগুলো বাস্তবায়নের হার কম থাকায় যৌতুক, পারিবারিক নির্যাতন, এসিড-সন্ত্রাসের শিকার, কর্মক্ষেত্রে বৈষম্য, সম্পত্তিতে বঞ্চনার শিকার হচ্ছেন নারীরা। নারী ও শিশু নির্যাতন আদালত, পারিবারিক আদালত এবং ফৌজদারি আদালতে নারীসংক্রান্ত বিষয়ে কয়েক লক্ষাধিক মামলা বিচারাধীন রয়েছে। বছরের পর বছর এসব মামলার নিষ্পত্তি না হওয়ায় নারীরা তাঁদের ন্যায্য অধিকার থেকে বঞ্চিত হচ্ছেন। তৃণমূল পর্যায়ে নারীর ক্ষমতায়ন বাড়েনি। শিক্ষা ক্ষেত্রে নারীরা এগিয়ে এলেও উচ্চপর্যায়ে কর্মক্ষেত্রে নারীরা এখনো অনেক পিছিয়ে রয়েছেন।\n" +
                "\n" +
                "এ বিষয়ে বাংলাদেশ মহিলা আইনজীবী সমিতির সাবেক সহসভাপতি অ্যাডভোকেট ফাহিমা নাসরিন মুন্নি এনটিভি অনলাইনকে বলেন, ‘রাষ্ট্রই প্রথমে নারীদের বঞ্চিত করছে। কেননা বাজেটে নারীদের জন্য কম বরাদ্দ ও অনগ্রসর গোষ্ঠী হিসেবে গণ্য করছে। রাষ্ট্র যদি নারীদের এমন দৃষ্টিভঙ্গিতে দেখে, তাহলে সাধারণ মানুষের দৃষ্টিভঙ্গির পরিবর্তন ঘটবে কীভাবে? নারীর অধিকার ও ক্ষমতায়নে শুধু আইন করলেই হবে না, প্রয়োজন সেটির বাস্তবায়ন।’"));
        data.add(new Model("নারীর অধিকার প্রতিষ্ঠায় করণীয়","অনেক দেশেই সংবিধানের ভিত্তিতে নারীর অধিকার নিশ্চিত করা হয়েছে। এ জন্য প্রয়োজনে তারা সংবিধানকে সংশোধন করেছে। তাই নারী অধিকার প্রতিষ্ঠায় প্রয়োজন আইনের প্রয়োগ ও ইতিবাচক সামাজিক দৃষ্টিভঙ্গির প্রসার।\n" +
                "\n" +
                "নারীদের অধিকার প্রতিষ্ঠায় করণীয় প্রসঙ্গে সুপ্রিম কোর্টের আইনজীবী শেখ আক্তার উল ইসলাম বলেন, ‘নারীর অধিকার বাস্তবায়নে সবচেয়ে বড় বাধা হলো পুরুষতান্ত্রিক সমাজে মানুষের মানসিকতা। পুরুষদের মানসিকতা পরিবর্তন করতে পারলে সমাজে নারীদের অধিকার সহজেই প্রতিষ্ঠা পাবে।’"));



        recyclerView=findViewById(R.id.recycleView);
        adapter=new RecyclerViewAdapter(this,data);
        LinearLayoutManager manager = new LinearLayoutManager(this);
        recyclerView.setLayoutManager(manager);
        recyclerView.setHasFixedSize(true);
        recyclerView.setAdapter(adapter);
    }

    @Override
    public boolean onCreateOptionsMenu(Menu menu) {
        MenuInflater inflater=getMenuInflater();
        inflater.inflate(R.menu.menu,menu);
        return true;
    }

    @Override
    public boolean onOptionsItemSelected(MenuItem item) {

        switch (item.getItemId()) {
            case R.id.call:
                Intent i = new Intent(this,ContactActivity.class);
                this.startActivity(i);
                return true;
            default:
                return super.onOptionsItemSelected(item);
        }


    }
}
